# NumberType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..NumberType Property
RevisionNumberingSequence Class See Also
---
Indicates the revision number type of the revision numbering sequence.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public RevisionNumberType NumberType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberType As RevisionNumberType
	Get
```

Visual C++
---
```text
public:
property RevisionNumberType NumberType {
	RevisionNumberType get ();
}
```

# Remarks
This property can be used to figure out if a revision numbering sequence is numeric or alphanumeric. The returned RevisionNumberType is either RevisionNumberType::Numeric or RevisionNumberType::Alphanumeric.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RevisionNumberingSequence doesn't own a valid revision settings for number type. |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace